In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
s= pd.Series(np.random.random(5))
s

0    0.994379
1    0.174096
2    0.006730
3    0.720310
4    0.417108
dtype: float64

In [4]:
s[1]

0.17409589937620862

In [5]:
s[0:3]

0    0.994379
1    0.174096
2    0.006730
dtype: float64

In [6]:
s[0]=45

In [7]:
s

0    45.000000
1     0.174096
2     0.006730
3     0.720310
4     0.417108
dtype: float64

In [9]:
s.index=["a","b","c","d","e"]  #change the index values from 0 1 2 3 4 to a b c d e
s

a    45.000000
b     0.174096
c     0.006730
d     0.720310
e     0.417108
dtype: float64

In [10]:
s["a"]

45.0

In [11]:
s["d"]

0.7203103201660693

In [12]:
a= pd.Series(np.random.random(6),index=["a","b","c","d","e","f"])
a

a    0.288208
b    0.389035
c    0.418689
d    0.861756
e    0.417786
f    0.728329
dtype: float64

In [13]:
a.argmax()

3

In [14]:
a.argmin()

0

In [15]:
a.argsort()

a    0
b    1
c    4
d    2
e    5
f    3
dtype: int64

In [16]:
a.cumsum()

a    0.288208
b    0.677243
c    1.095931
d    1.957687
e    2.375474
f    3.103803
dtype: float64

In [17]:
a.mean()

0.5173005082536478

In [18]:
a.median()

0.4182376352813972

In [19]:
a.max()

0.8617559710023593

# DATA FRAMA

In [20]:
b1 = pd.Series(np.random.random(5))

In [21]:
b2 = pd.Series(np.random.random(5))

In [22]:
b1,b2

(0    0.246298
 1    0.503990
 2    0.434759
 3    0.571424
 4    0.829926
 dtype: float64,
 0    0.742299
 1    0.260871
 2    0.734305
 3    0.989841
 4    0.525708
 dtype: float64)

In [23]:
pd.DataFrame([b1,b2])

          0         1         2         3         4
0  0.246298  0.503990  0.434759  0.571424  0.829926
1  0.742299  0.260871  0.734305  0.989841  0.525708

In [24]:
pd.DataFrame([b1,b2],columns=["a","b","c","d"])

    a   b   c   d
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN

In [82]:
d={
    "abc":pd.Series([11,22,33],index=["a","b","c"]),                         #Taking a dictionary
    "xyz":pd.Series([55,66,77,88],index=["a","b","c","d"])
}

In [26]:
d

{'abc': a    11
 b    22
 c    33
 dtype: int64,
 'xyz': a    55
 b    66
 c    77
 d    88
 dtype: int64}

In [27]:
data = pd.DataFrame(d)
data

    abc  xyz
a  11.0   55
b  22.0   66
c  33.0   77
d   NaN   88

In [28]:
data.max()

abc    33.0
xyz    88.0
dtype: float64

In [30]:
l={"name":["vamsi","ashi","bharath","pradeep","mohan"],"age":[19,19,20,20,20],"surname":["dandu","mulagapaka","Barma","ch","ommi"]}
fa = pd.DataFrame(l)

In [31]:
fa

      name  age     surname
0    vamsi   19       dandu
1     ashi   19  mulagapaka
2  bharath   20       Barma
3  pradeep   20          ch
4    mohan   20        ommi

In [32]:
r={"name":["sai kumar","sathvik","swamy","sidhu","bhanu"],"age":[21,20,20,21,19],"weight":[34,56,67,45,42]}
ra=pd.DataFrame(r)

In [33]:
ra

        name  age  weight
0  sai kumar   21      34
1    sathvik   20      56
2      swamy   20      67
3      sidhu   21      45
4      bhanu   19      42

In [34]:
print(fa)
print(ra)

      name  age     surname
0    vamsi   19       dandu
1     ashi   19  mulagapaka
2  bharath   20       Barma
3  pradeep   20          ch
4    mohan   20        ommi
        name  age  weight
0  sai kumar   21      34
1    sathvik   20      56
2      swamy   20      67
3      sidhu   21      45
4      bhanu   19      42

In [35]:
fa.merge(ra)   # merge function won't work in pandas

Empty DataFrame
Columns: [name, age, surname, weight]
Index: []

In [36]:
lq=pd.concat([fa,ra])
lq

        name  age     surname  weight
0      vamsi   19       dandu     NaN
1       ashi   19  mulagapaka     NaN
2    bharath   20       Barma     NaN
3    pradeep   20          ch     NaN
4      mohan   20        ommi     NaN
0  sai kumar   21         NaN    34.0
1    sathvik   20         NaN    56.0
2      swamy   20         NaN    67.0
3      sidhu   21         NaN    45.0
4      bhanu   19         NaN    42.0

In [37]:
import os

In [68]:
da = pd.read_excel("C:/MLDATASETS/Data.xlsx")              #to read a  excel file(dataset) from computer

In [69]:
da

   country   age   salary purchased
0   france  44.0  72000.0        no
1    spain  27.0  48000.0       yes
2  germany  30.0  54000.0        no
3    spain  38.0  61000.0        no
4  germany  40.0      NaN       yes
5   france  35.0  58000.0       yes
6    spain   NaN  52000.0        no
7   france  48.0  79000.0       yes
8  germany  50.0  83000.0        no
9   france  37.0  67000.0       yes

In [70]:
dc = pd.read_csv("C:/MLDATASETS/insurance.csv")

In [71]:
dc

      age     sex     bmi  children smoker     region      charges
0      19  female  29.000         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [72]:
dc.head()           #will dispaly the first 5 rows of the data set

   age     sex     bmi  children smoker     region      charges
0   19  female  29.000         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [73]:
dc.tail()            #will dispaly the last 5 rows of the data set

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [74]:
dc.head(17)

    age     sex     bmi  children smoker     region      charges
0    19  female  29.000         0    yes  southwest  16884.92400
1    18    male  33.770         1     no  southeast   1725.55230
2    28    male  33.000         3     no  southeast   4449.46200
3    33    male  22.705         0     no  northwest  21984.47061
4    32    male  28.880         0     no  northwest   3866.85520
5    31  female  25.740         0     no  southeast   3756.62160
6    46  female  33.440         1     no  southeast   8240.58960
7    37  female  27.740         3     no  northwest   7281.50560
8    37    male  29.830         2     no  northeast   6406.41070
9    60  female  25.840         0     no  northwest  28923.13692
10   25    male  26.220         0     no  northeast   2721.32080
11   62  female  26.290         0    yes  southeast  27808.72510
12   23    male  34.400         0     no  southwest   1826.84300
13   56  female  39.820         0     no  southeast  11090.71780
14   27    male  42.130         0    yes  southeast  39611.75770
15   19    male  24.600         1     no  southwest   1837.23700
16   52  female  30.780         1     no  northeast  10797.33620

In [75]:
dc.shape            #no of columns and rows

(1338, 7)

In [76]:
dc["new"]=np.random.random(1338)     #adding new column

In [77]:
dc

      age     sex     bmi  children smoker     region      charges       new
0      19  female  29.000         0    yes  southwest  16884.92400  0.118618
1      18    male  33.770         1     no  southeast   1725.55230  0.241750
2      28    male  33.000         3     no  southeast   4449.46200  0.370943
3      33    male  22.705         0     no  northwest  21984.47061  0.474965
4      32    male  28.880         0     no  northwest   3866.85520  0.221782
...   ...     ...     ...       ...    ...        ...          ...       ...
1333   50    male  30.970         3     no  northwest  10600.54830  0.219385
1334   18  female  31.920         0     no  northeast   2205.98080  0.143590
1335   18  female  36.850         0     no  southeast   1629.83350  0.256300
1336   21  female  25.800         0     no  southwest   2007.94500  0.090256
1337   61  female  29.070         0    yes  northwest  29141.36030  0.390553

[1338 rows x 8 columns]

In [78]:
dc.drop(["new"],axis=1)         #remove column from DataFrame

      age     sex     bmi  children smoker     region      charges
0      19  female  29.000         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [79]:
dc['charges']

0       16884.92400
1        1725.55230
2        4449.46200
3       21984.47061
4        3866.85520
           ...
1333    10600.54830
1334     2205.98080
1335     1629.83350
1336     2007.94500
1337    29141.36030
Name: charges, Length: 1338, dtype: float64

In [80]:
dc[dc['charges']>60000]     #showing charges greater than 60000 in the DataFrame

      age     sex     bmi  children smoker     region      charges       new
543    54  female  47.410         0    yes  southeast  63770.42801  0.194373
1230   52    male  34.485         3    yes  northwest  60021.39897  0.430714
1300   45    male  30.360         0    yes  southeast  62592.87309  0.366569

In [81]:
lq[lq['age']>20]

        name  age surname  weight
0  sai kumar   21     NaN    34.0
3      sidhu   21     NaN    45.0